{
  "digital-scale": {
    "name": "Digital scale",
    "category": "measuring",
    "domain": [
      "craft"
    ],
    "description": "Precision scale for measuring oils, lye, and additives by weight.",
    "details": "A scale is essential for soapmaking. Volume-based measuring is not precise enough for predictable results.",
    "considerations": [
      "Ensure maximum weight capacity suits your needs",
      "Recommended precision to 0.1g (1g is acceptable for large batches)",
      "Tare function is required",
      "Must be at least splash resistant, but waterproof preferred"
    ]
  },
  "immersion-blender": {
    "name": "Immersion blender (stick blender)",
    "category": "mixing",
    "domain": [
      "craft"
    ],
    "description": "Handheld immersion blender used to emulsify oils and lye solution and quickly bring mixture to trace.",
    "details": "An immersion blender reduces mixing time from 30 to 60 minutes (if stirring by hand) to 2 to 5 minutes. Use short bursts of 2 to 3 seconds, alternating with stirring to avoid reaching trace unexpectedly quickly.",
    "considerations": [
      "Must have a stainless steel shaft (not aluminium, which reacts with lye)",
      "Best to dedicate to soapmaking only to avoid cross-contamination with food",
      "Recommend 200W+ to ensure thick batters don't stop it"
    ],
    "safetyNotes": [
      "Never use while the fat/lye solution is hot",
      "Keep blade submerged while blender is running to prevent splashing",
      "Unplug when not in use"
    ]
  },
  "silicone-mould": {
    "name": "Silicone mould",
    "category": "mould",
    "domain": [
      "craft"
    ],
    "description": "Flexible silicone mould for shaping soap.",
    "details": "Silicone allows soap to release easily without sticking and insulates well, which promotes gel phase.",
    "considerations": [
      "Choose food-grade silicone rated to 230째C",
      "Some need external support (wooden frame)"
    ]
  },
  "wooden-loaf-mould": {
    "name": "Wooden loaf mould",
    "category": "mould",
    "domain": [
      "craft"
    ],
    "description": "Wooden box mould lined with freezer paper or silicone. Provides excellent insulation for gel phase.",
    "details": "Wooden moulds insulate well, which promotes an gel phase throughout the loaf.",
    "considerations": [
      "Heavier and less flexible than silicone",
      "Requires lining (freezer paper, silicone); unlined wood will become unusable as it becomes saturated with moisture and soap."
    ]
  },
  "safety-goggles": {
    "name": "Safety goggles",
    "category": "safety",
    "domain": [
      "craft"
    ],
    "description": "Chemical splash goggles that seal around the eyes to protect against lye splashes.",
    "details": "Any glasses with open sides do not protect against vapours or random splashes that can cause serious eye injury.\n\nChoose goggles rated for chemical splash protection, not just impact protection, with indirect ventilation to prevent fogging while keeping liquids out.",
    "considerations": [
      "Must seal completely around eyes",
      "Must be chemical splash rated (ANSI Z87.1 or equivalent)",
      "Anti-fog coating or indirect ventilation is helpful",
      "Should fit over prescription glasses if needed"
    ],
    "safetyNotes": [
      "Wear whenever handling lye or raw soap",
      "Replace if scratched or damaged"
    ],
    "references": [
      {
        "sourceId": "ansi",
        "section": "ANSI/ISEA Z87.1 Eye and Face Protection",
        "url": "https://www.safetyequipment.org/standards/ansiisea-z87-1/",
        "note": "American standard for occupational eye and face protection"
      }
    ]
  },
  "rubber-gloves": {
    "name": "Rubber gloves",
    "category": "safety",
    "domain": [
      "craft"
    ],
    "description": "Chemical-resistant gloves to protect hands from lye and raw soap batter.",
    "details": "Nitrile or neoprene gloves provide good protection against lye. Latex may degrade faster with repeated exposure, but works if disposable latex gloves are all you have available.",
    "considerations": [
      "Choose gloves with a minimum 8 mil thickness for durability if using reusable gloves",
      "Opt for wrist-length gloves as a minimum; choose elbow-length gloves when handling large batches of chemicals"
    ],
    "safetyNotes": [
      "Wear whenever handling lye or raw soap",
      "Check for holes before each use and replace if torn or punctured",
      "Wash gloves before removing to prevent caustic drips"
    ],
    "references": [
      {
        "sourceId": "echa",
        "section": "Sodium hydroxide chemical safety",
        "url": "https://echa.europa.eu/substance-information/-/substanceinfo/100.013.805",
        "note": "Chemical resistance guidance for protective equipment"
      }
    ]
  },
  "thermometer": {
    "name": "Thermometer",
    "category": "measuring",
    "domain": [
      "craft"
    ],
    "description": "Device for monitoring fat and lye solution temperatures.",
    "details": "Ideally, start the mixed melted fat and lye solution at 38 - 54째C to avoid false trace.",
    "considerations": [
      "Range: at least 0-120째C",
      "Probe type more accurate than infrared, which measure surface temperature only",
      "Instant-read digital models most convenient",
      "Best practice to dedicate one to soapmaking to avoid cross-contamination concerns"
    ]
  },
  "soap-cutter": {
    "name": "Soap cutter",
    "category": "cutting",
    "domain": [
      "craft"
    ],
    "description": "Tool for cutting loaf soap into uniform bars",
    "details": "You can use a knife, a wire stretched across a frame, or specialized multi-bar cutters; aim to cut soap while it's firm but not very hard.",
    "considerations": [
      "Wire cutters provide clean cuts with minimal drag",
      "A knife provides more control but may drag through soft soap",
      "Multi-bar cutters helf achieve consistent thickness",
      "A mitre box helps achieve straight cuts"
    ]
  },
  "mixing-containers": {
    "name": "Mixing containers",
    "category": "mixing",
    "domain": [
      "craft"
    ],
    "description": "Heat-resistant containers for mixing lye solution and combining with oils. Must be lye-safe materials.",
    "details": "For lye, use heat-resistant plastic (PP #5, HDPE #2), stainless steel, or tempered/borosilicate glass.\n\nFor soap batter, use stainless steel or heavy-duty plastic pitchers.",
    "considerations": [
      "Heat-resistant to at least 93째C",
      "Wide opening for stirring",
      "Pour spout helpful for moulding"
    ],
    "safetyNotes": [
      "NEVER use aluminum, which is violently reactive with lye",
      "Check recycling code on plastic (PP #5 or HDPE #2 only)",
      "Inspect for cracks before each use",
      "Dedicate to soapmaking to avoid cross-contamination with food"
    ]
  },
  "curing-rack": {
    "name": "Curing rack",
    "category": "storage",
    "domain": [
      "craft"
    ],
    "description": "Open-air rack for curing soap bars. Allows air circulation on all sides for even water evaporation.",
    "details": "Soap needs 4 to 6 weeks of curing time after unmoulding (and, if using a loaf mould, slicing) for water to evaporate and saponification to complete.",
    "considerations": [
      "Use an open design for air circulation on all sides",
      "Ensure it's sturdy enough to hold multiple batches",
      "Place in cool, dry area with good airflow",
      "Avoid direct sunlight"
    ]
  }
}
